Revit 2026 API

# MacroEnvironment Enumeration

---

The Macro environments.

**Namespace:** Autodesk.Revit.DB.Macros**Assembly:** RevitAPIMacros (in RevitAPIMacros.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum MacroEnvironment
```
```vb
Public Enumeration MacroEnvironment
```
```cpp
public enum class MacroEnvironment
```
```fsharp
type MacroEnvironment
```

| Member name | Value | Description |
| --- | --- | --- |
| DB | 1 | The DB environment. |
| UI | 2 | The UI environment. |

#### Reference

Autodesk.Revit.DB.Macros Namespace